MikroElektronika/core_packages/PIC/XC8/def/PIC16C745/mcu.h
extern volatile ADCON1bits_t ADCON1bits __at(0x09F);
// bitfield macros
#define _ADCON1_PCFG_POSN                                   0x0
#define _ADCON1_PCFG_POSITION                               0x0
#define _ADCON1_PCFG_SIZE                                   0x3
#define _ADCON1_PCFG_LENGTH                                 0x3
#define _ADCON1_PCFG_MASK                                   0x7
#define _ADCON1_PCFG0_POSN                                  0x0
#define _ADCON1_PCFG0_POSITION                              0x0
#define _ADCON1_PCFG0_SIZE                                  0x1
#define _ADCON1_PCFG0_LENGTH                                0x1
#define _ADCON1_PCFG0_MASK                                  0x1
#define _ADCON1_PCFG1_POSN                                  0x1
#define _ADCON1_PCFG1_POSITION                              0x1
#define _ADCON1_PCFG1_SIZE                                  0x1
#define _ADCON1_PCFG1_LENGTH                                0x1
#define _ADCON1_PCFG1_MASK                                  0x2
#define _ADCON1_PCFG2_POSN                                  0x2
#define _ADCON1_PCFG2_POSITION                              0x2
#define _ADCON1_PCFG2_SIZE                                  0x1
#define _ADCON1_PCFG2_LENGTH                                0x1
#define _ADCON1_PCFG2_MASK                                  0x4

// Register: UIR
#define UIR UIR
extern volatile unsigned char           UIR                 __at(0x190);
#ifndef _LIB_BUILD
asm("UIR equ 0190h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned USB_RST                :1;
        unsigned UERR                   :1;
        unsigned ACTIVITY               :1;
        unsigned TOK_DNE                :1;
        unsigned UIDLE                  :1;
        unsigned STALL                  :1;
    };
} UIRbits_t;
extern volatile UIRbits_t UIRbits __at(0x190);
// bitfield macros
#define _UIR_USB_RST_POSN                                   0x0
#define _UIR_USB_RST_POSITION                               0x0
#define _UIR_USB_RST_SIZE                                   0x1
#define _UIR_USB_RST_LENGTH                                 0x1
#define _UIR_USB_RST_MASK                                   0x1
#define _UIR_UERR_POSN                                      0x1
#define _UIR_UERR_POSITION                                  0x1
#define _UIR_UERR_SIZE                                      0x1
#define _UIR_UERR_LENGTH                                    0x1
#define _UIR_UERR_MASK                                      0x2
#define _UIR_ACTIVITY_POSN                                  0x2
#define _UIR_ACTIVITY_POSITION                              0x2
#define _UIR_ACTIVITY_SIZE                                  0x1
#define _UIR_ACTIVITY_LENGTH                                0x1
#define _UIR_ACTIVITY_MASK                                  0x4
#define _UIR_TOK_DNE_POSN                                   0x3
#define _UIR_TOK_DNE_POSITION                               0x3
#define _UIR_TOK_DNE_SIZE                                   0x1
#define _UIR_TOK_DNE_LENGTH                                 0x1
#define _UIR_TOK_DNE_MASK                                   0x8
#define _UIR_UIDLE_POSN                                     0x4
#define _UIR_UIDLE_POSITION                                 0x4
#define _UIR_UIDLE_SIZE                                     0x1
#define _UIR_UIDLE_LENGTH                                   0x1
#define _UIR_UIDLE_MASK                                     0x10
#define _UIR_STALL_POSN                                     0x5
#define _UIR_STALL_POSITION                                 0x5
#define _UIR_STALL_SIZE                                     0x1
#define _UIR_STALL_LENGTH                                   0x1
#define _UIR_STALL_MASK                                     0x20

// Register: UIE
#define UIE UIE
extern volatile unsigned char           UIE                 __at(0x191);
#ifndef _LIB_BUILD
asm("UIE equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned USB_RST                :1;
        unsigned UERR                   :1;
        unsigned ACTIVITY               :1;
        unsigned TOK_DNE                :1;
        unsigned UIDLE                  :1;
        unsigned STALL                  :1;
    };
} UIEbits_t;
extern volatile UIEbits_t UIEbits __at(0x191);
// bitfield macros
#define _UIE_USB_RST_POSN                                   0x0
#define _UIE_USB_RST_POSITION                               0x0
#define _UIE_USB_RST_SIZE                                   0x1
#define _UIE_USB_RST_LENGTH                                 0x1
#define _UIE_USB_RST_MASK                                   0x1
#define _UIE_UERR_POSN                                      0x1
#define _UIE_UERR_POSITION                                  0x1
#define _UIE_UERR_SIZE                                      0x1
#define _UIE_UERR_LENGTH                                    0x1
#define _UIE_UERR_MASK                                      0x2
#define _UIE_ACTIVITY_POSN                                  0x2
#define _UIE_ACTIVITY_POSITION                              0x2
#define _UIE_ACTIVITY_SIZE                                  0x1
#define _UIE_ACTIVITY_LENGTH                                0x1
#define _UIE_ACTIVITY_MASK                                  0x4
#define _UIE_TOK_DNE_POSN                                   0x3
#define _UIE_TOK_DNE_POSITION                               0x3
#define _UIE_TOK_DNE_SIZE                                   0x1
#define _UIE_TOK_DNE_LENGTH                                 0x1
#define _UIE_TOK_DNE_MASK                                   0x8
#define _UIE_UIDLE_POSN                                     0x4
#define _UIE_UIDLE_POSITION                                 0x4
#define _UIE_UIDLE_SIZE                                     0x1
#define _UIE_UIDLE_LENGTH                                   0x1
#define _UIE_UIDLE_MASK                                     0x10
#define _UIE_STALL_POSN                                     0x5
#define _UIE_STALL_POSITION                                 0x5
#define _UIE_STALL_SIZE                                     0x1
#define _UIE_STALL_LENGTH                                   0x1
#define _UIE_STALL_MASK                                     0x20

// Register: UEIR
#define UEIR UEIR
extern volatile unsigned char           UEIR                __at(0x192);
#ifndef _LIB_BUILD
asm("UEIR equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID_ERR                :1;
        unsigned CRC5                   :1;
        unsigned CRC16                  :1;
        unsigned DFN8                   :1;
        unsigned BTO_ERR                :1;
        unsigned WRT_ERR                :1;
        unsigned OWN_ERR                :1;
        unsigned BTS_ERR                :1;
    };
} UEIRbits_t;
extern volatile UEIRbits_t UEIRbits __at(0x192);
// bitfield macros
#define _UEIR_PID_ERR_POSN                                  0x0
#define _UEIR_PID_ERR_POSITION                              0x0
#define _UEIR_PID_ERR_SIZE                                  0x1
#define _UEIR_PID_ERR_LENGTH                                0x1
#define _UEIR_PID_ERR_MASK                                  0x1
#define _UEIR_CRC5_POSN                                     0x1
#define _UEIR_CRC5_POSITION                                 0x1
#define _UEIR_CRC5_SIZE                                     0x1
#define _UEIR_CRC5_LENGTH                                   0x1
#define _UEIR_CRC5_MASK                                     0x2
#define _UEIR_CRC16_POSN                                    0x2
#define _UEIR_CRC16_POSITION                                0x2
#define _UEIR_CRC16_SIZE                                    0x1
#define _UEIR_CRC16_LENGTH                                  0x1
#define _UEIR_CRC16_MASK                                    0x4
#define _UEIR_DFN8_POSN                                     0x3
#define _UEIR_DFN8_POSITION                                 0x3
#define _UEIR_DFN8_SIZE                                     0x1
#define _UEIR_DFN8_LENGTH                                   0x1
#define _UEIR_DFN8_MASK                                     0x8
#define _UEIR_BTO_ERR_POSN                                  0x4
#define _UEIR_BTO_ERR_POSITION                              0x4
#define _UEIR_BTO_ERR_SIZE                                  0x1
#define _UEIR_BTO_ERR_LENGTH                                0x1
#define _UEIR_BTO_ERR_MASK                                  0x10
#define _UEIR_WRT_ERR_POSN                                  0x5
#define _UEIR_WRT_ERR_POSITION                              0x5
#define _UEIR_WRT_ERR_SIZE                                  0x1
#define _UEIR_WRT_ERR_LENGTH                                0x1
#define _UEIR_WRT_ERR_MASK                                  0x20
#define _UEIR_OWN_ERR_POSN                                  0x6
#define _UEIR_OWN_ERR_POSITION                              0x6
#define _UEIR_OWN_ERR_SIZE                                  0x1
#define _UEIR_OWN_ERR_LENGTH                                0x1
#define _UEIR_OWN_ERR_MASK                                  0x40
#define _UEIR_BTS_ERR_POSN                                  0x7
#define _UEIR_BTS_ERR_POSITION                              0x7
#define _UEIR_BTS_ERR_SIZE                                  0x1
#define _UEIR_BTS_ERR_LENGTH                                0x1
#define _UEIR_BTS_ERR_MASK                                  0x80

