MikroElektronika/core_packages/PIC/XC8/def/PIC16C745/mcu.h
// Register: UEIE
#define UEIE UEIE
extern volatile unsigned char           UEIE                __at(0x193);
#ifndef _LIB_BUILD
asm("UEIE equ 0193h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID_ERR                :1;
        unsigned CRC5                   :1;
        unsigned CRC16                  :1;
        unsigned DFN8                   :1;
        unsigned BTO_ERR                :1;
        unsigned WRT_ERR                :1;
        unsigned OWN_ERR                :1;
        unsigned BTS_ERR                :1;
    };
} UEIEbits_t;
extern volatile UEIEbits_t UEIEbits __at(0x193);
// bitfield macros
#define _UEIE_PID_ERR_POSN                                  0x0
#define _UEIE_PID_ERR_POSITION                              0x0
#define _UEIE_PID_ERR_SIZE                                  0x1
#define _UEIE_PID_ERR_LENGTH                                0x1
#define _UEIE_PID_ERR_MASK                                  0x1
#define _UEIE_CRC5_POSN                                     0x1
#define _UEIE_CRC5_POSITION                                 0x1
#define _UEIE_CRC5_SIZE                                     0x1
#define _UEIE_CRC5_LENGTH                                   0x1
#define _UEIE_CRC5_MASK                                     0x2
#define _UEIE_CRC16_POSN                                    0x2
#define _UEIE_CRC16_POSITION                                0x2
#define _UEIE_CRC16_SIZE                                    0x1
#define _UEIE_CRC16_LENGTH                                  0x1
#define _UEIE_CRC16_MASK                                    0x4
#define _UEIE_DFN8_POSN                                     0x3
#define _UEIE_DFN8_POSITION                                 0x3
#define _UEIE_DFN8_SIZE                                     0x1
#define _UEIE_DFN8_LENGTH                                   0x1
#define _UEIE_DFN8_MASK                                     0x8
#define _UEIE_BTO_ERR_POSN                                  0x4
#define _UEIE_BTO_ERR_POSITION                              0x4
#define _UEIE_BTO_ERR_SIZE                                  0x1
#define _UEIE_BTO_ERR_LENGTH                                0x1
#define _UEIE_BTO_ERR_MASK                                  0x10
#define _UEIE_WRT_ERR_POSN                                  0x5
#define _UEIE_WRT_ERR_POSITION                              0x5
#define _UEIE_WRT_ERR_SIZE                                  0x1
#define _UEIE_WRT_ERR_LENGTH                                0x1
#define _UEIE_WRT_ERR_MASK                                  0x20
#define _UEIE_OWN_ERR_POSN                                  0x6
#define _UEIE_OWN_ERR_POSITION                              0x6
#define _UEIE_OWN_ERR_SIZE                                  0x1
#define _UEIE_OWN_ERR_LENGTH                                0x1
#define _UEIE_OWN_ERR_MASK                                  0x40
#define _UEIE_BTS_ERR_POSN                                  0x7
#define _UEIE_BTS_ERR_POSITION                              0x7
#define _UEIE_BTS_ERR_SIZE                                  0x1
#define _UEIE_BTS_ERR_LENGTH                                0x1
#define _UEIE_BTS_ERR_MASK                                  0x80

// Register: USTAT
#define USTAT USTAT
extern volatile unsigned char           USTAT               __at(0x194);
#ifndef _LIB_BUILD
asm("USTAT equ 0194h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned IN                     :1;
        unsigned ENDP                   :2;
    };
    struct {
        unsigned                        :3;
        unsigned ENDP0                  :1;
        unsigned ENDP1                  :1;
    };
} USTATbits_t;
extern volatile USTATbits_t USTATbits __at(0x194);
// bitfield macros
#define _USTAT_IN_POSN                                      0x2
#define _USTAT_IN_POSITION                                  0x2
#define _USTAT_IN_SIZE                                      0x1
#define _USTAT_IN_LENGTH                                    0x1
#define _USTAT_IN_MASK                                      0x4
#define _USTAT_ENDP_POSN                                    0x3
#define _USTAT_ENDP_POSITION                                0x3
#define _USTAT_ENDP_SIZE                                    0x2
#define _USTAT_ENDP_LENGTH                                  0x2
#define _USTAT_ENDP_MASK                                    0x18
#define _USTAT_ENDP0_POSN                                   0x3
#define _USTAT_ENDP0_POSITION                               0x3
#define _USTAT_ENDP0_SIZE                                   0x1
#define _USTAT_ENDP0_LENGTH                                 0x1
#define _USTAT_ENDP0_MASK                                   0x8
#define _USTAT_ENDP1_POSN                                   0x4
#define _USTAT_ENDP1_POSITION                               0x4
#define _USTAT_ENDP1_SIZE                                   0x1
#define _USTAT_ENDP1_LENGTH                                 0x1
#define _USTAT_ENDP1_MASK                                   0x10

// Register: UCTRL
#define UCTRL UCTRL
extern volatile unsigned char           UCTRL               __at(0x195);
#ifndef _LIB_BUILD
asm("UCTRL equ 0195h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned SUSPND                 :1;
        unsigned RESUME                 :1;
        unsigned DEV_ATT                :1;
        unsigned PKT_DIS                :1;
        unsigned SE0                    :1;
    };
} UCTRLbits_t;
extern volatile UCTRLbits_t UCTRLbits __at(0x195);
// bitfield macros
#define _UCTRL_SUSPND_POSN                                  0x1
#define _UCTRL_SUSPND_POSITION                              0x1
#define _UCTRL_SUSPND_SIZE                                  0x1
#define _UCTRL_SUSPND_LENGTH                                0x1
#define _UCTRL_SUSPND_MASK                                  0x2
#define _UCTRL_RESUME_POSN                                  0x2
#define _UCTRL_RESUME_POSITION                              0x2
#define _UCTRL_RESUME_SIZE                                  0x1
#define _UCTRL_RESUME_LENGTH                                0x1
#define _UCTRL_RESUME_MASK                                  0x4
#define _UCTRL_DEV_ATT_POSN                                 0x3
#define _UCTRL_DEV_ATT_POSITION                             0x3
#define _UCTRL_DEV_ATT_SIZE                                 0x1
#define _UCTRL_DEV_ATT_LENGTH                               0x1
#define _UCTRL_DEV_ATT_MASK                                 0x8
#define _UCTRL_PKT_DIS_POSN                                 0x4
#define _UCTRL_PKT_DIS_POSITION                             0x4
#define _UCTRL_PKT_DIS_SIZE                                 0x1
#define _UCTRL_PKT_DIS_LENGTH                               0x1
#define _UCTRL_PKT_DIS_MASK                                 0x10
#define _UCTRL_SE0_POSN                                     0x5
#define _UCTRL_SE0_POSITION                                 0x5
#define _UCTRL_SE0_SIZE                                     0x1
#define _UCTRL_SE0_LENGTH                                   0x1
#define _UCTRL_SE0_MASK                                     0x20

// Register: UADDR
#define UADDR UADDR
extern volatile unsigned char           UADDR               __at(0x196);
#ifndef _LIB_BUILD
asm("UADDR equ 0196h");
#endif

// Register: USWSTAT
#define USWSTAT USWSTAT
extern volatile unsigned char           USWSTAT             __at(0x197);
#ifndef _LIB_BUILD
asm("USWSTAT equ 0197h");
#endif

// Register: UEP0
#define UEP0 UEP0
extern volatile unsigned char           UEP0                __at(0x198);
#ifndef _LIB_BUILD
asm("UEP0 equ 0198h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EP_STALL               :1;
        unsigned EP_IN_EN               :1;
        unsigned EP_OUT_EN              :1;
        unsigned EP_CTL_DIS             :1;
    };
} UEP0bits_t;
extern volatile UEP0bits_t UEP0bits __at(0x198);
// bitfield macros
#define _UEP0_EP_STALL_POSN                                 0x0
#define _UEP0_EP_STALL_POSITION                             0x0
#define _UEP0_EP_STALL_SIZE                                 0x1
#define _UEP0_EP_STALL_LENGTH                               0x1
#define _UEP0_EP_STALL_MASK                                 0x1
#define _UEP0_EP_IN_EN_POSN                                 0x1
#define _UEP0_EP_IN_EN_POSITION                             0x1
#define _UEP0_EP_IN_EN_SIZE                                 0x1
#define _UEP0_EP_IN_EN_LENGTH                               0x1
#define _UEP0_EP_IN_EN_MASK                                 0x2
#define _UEP0_EP_OUT_EN_POSN                                0x2
#define _UEP0_EP_OUT_EN_POSITION                            0x2
#define _UEP0_EP_OUT_EN_SIZE                                0x1
#define _UEP0_EP_OUT_EN_LENGTH                              0x1
#define _UEP0_EP_OUT_EN_MASK                                0x4
#define _UEP0_EP_CTL_DIS_POSN                               0x3
#define _UEP0_EP_CTL_DIS_POSITION                           0x3
#define _UEP0_EP_CTL_DIS_SIZE                               0x1
#define _UEP0_EP_CTL_DIS_LENGTH                             0x1
#define _UEP0_EP_CTL_DIS_MASK                               0x8

// Register: UEP1
#define UEP1 UEP1
extern volatile unsigned char           UEP1                __at(0x199);
#ifndef _LIB_BUILD
asm("UEP1 equ 0199h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EP_STALL               :1;
        unsigned EP_IN_EN               :1;
        unsigned EP_OUT_EN              :1;
        unsigned EP_CTL_DIS             :1;
    };
} UEP1bits_t;
