MikroElektronika/core_packages/PIC/XC8/def/PIC16C745/mcu.h
extern volatile BD0IBCbits_t BD0IBCbits __at(0x1A5);
// bitfield macros
#define _BD0IBC_BC_POSN                                     0x0
#define _BD0IBC_BC_POSITION                                 0x0
#define _BD0IBC_BC_SIZE                                     0x4
#define _BD0IBC_BC_LENGTH                                   0x4
#define _BD0IBC_BC_MASK                                     0xF
#define _BD0IBC_BC0_POSN                                    0x0
#define _BD0IBC_BC0_POSITION                                0x0
#define _BD0IBC_BC0_SIZE                                    0x1
#define _BD0IBC_BC0_LENGTH                                  0x1
#define _BD0IBC_BC0_MASK                                    0x1
#define _BD0IBC_BC1_POSN                                    0x1
#define _BD0IBC_BC1_POSITION                                0x1
#define _BD0IBC_BC1_SIZE                                    0x1
#define _BD0IBC_BC1_LENGTH                                  0x1
#define _BD0IBC_BC1_MASK                                    0x2
#define _BD0IBC_BC2_POSN                                    0x2
#define _BD0IBC_BC2_POSITION                                0x2
#define _BD0IBC_BC2_SIZE                                    0x1
#define _BD0IBC_BC2_LENGTH                                  0x1
#define _BD0IBC_BC2_MASK                                    0x4
#define _BD0IBC_BC3_POSN                                    0x3
#define _BD0IBC_BC3_POSITION                                0x3
#define _BD0IBC_BC3_SIZE                                    0x1
#define _BD0IBC_BC3_LENGTH                                  0x1
#define _BD0IBC_BC3_MASK                                    0x8

// Register: BD0IAL
#define BD0IAL BD0IAL
extern volatile unsigned char           BD0IAL              __at(0x1A6);
#ifndef _LIB_BUILD
asm("BD0IAL equ 01A6h");
#endif

// Register: BD1OST
#define BD1OST BD1OST
extern volatile unsigned char           BD1OST              __at(0x1A8);
#ifndef _LIB_BUILD
asm("BD1OST equ 01A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD1OSTbits_t;
extern volatile BD1OSTbits_t BD1OSTbits __at(0x1A8);
// bitfield macros
#define _BD1OST_PID0_BSTALL_POSN                            0x2
#define _BD1OST_PID0_BSTALL_POSITION                        0x2
#define _BD1OST_PID0_BSTALL_SIZE                            0x1
#define _BD1OST_PID0_BSTALL_LENGTH                          0x1
#define _BD1OST_PID0_BSTALL_MASK                            0x4
#define _BD1OST_PID1_DTS_POSN                               0x3
#define _BD1OST_PID1_DTS_POSITION                           0x3
#define _BD1OST_PID1_DTS_SIZE                               0x1
#define _BD1OST_PID1_DTS_LENGTH                             0x1
#define _BD1OST_PID1_DTS_MASK                               0x8
#define _BD1OST_PID2_POSN                                   0x4
#define _BD1OST_PID2_POSITION                               0x4
#define _BD1OST_PID2_SIZE                                   0x1
#define _BD1OST_PID2_LENGTH                                 0x1
#define _BD1OST_PID2_MASK                                   0x10
#define _BD1OST_PID3_POSN                                   0x5
#define _BD1OST_PID3_POSITION                               0x5
#define _BD1OST_PID3_SIZE                                   0x1
#define _BD1OST_PID3_LENGTH                                 0x1
#define _BD1OST_PID3_MASK                                   0x20
#define _BD1OST_DATA0_1_POSN                                0x6
#define _BD1OST_DATA0_1_POSITION                            0x6
#define _BD1OST_DATA0_1_SIZE                                0x1
#define _BD1OST_DATA0_1_LENGTH                              0x1
#define _BD1OST_DATA0_1_MASK                                0x40
#define _BD1OST_UOWN_POSN                                   0x7
#define _BD1OST_UOWN_POSITION                               0x7
#define _BD1OST_UOWN_SIZE                                   0x1
#define _BD1OST_UOWN_LENGTH                                 0x1
#define _BD1OST_UOWN_MASK                                   0x80
#define _BD1OST_PID0_POSN                                   0x2
#define _BD1OST_PID0_POSITION                               0x2
#define _BD1OST_PID0_SIZE                                   0x1
#define _BD1OST_PID0_LENGTH                                 0x1
#define _BD1OST_PID0_MASK                                   0x4
#define _BD1OST_PID1_POSN                                   0x3
#define _BD1OST_PID1_POSITION                               0x3
#define _BD1OST_PID1_SIZE                                   0x1
#define _BD1OST_PID1_LENGTH                                 0x1
#define _BD1OST_PID1_MASK                                   0x8
#define _BD1OST_DATA01_POSN                                 0x6
#define _BD1OST_DATA01_POSITION                             0x6
#define _BD1OST_DATA01_SIZE                                 0x1
#define _BD1OST_DATA01_LENGTH                               0x1
#define _BD1OST_DATA01_MASK                                 0x40
#define _BD1OST_OWN_POSN                                    0x7
#define _BD1OST_OWN_POSITION                                0x7
#define _BD1OST_OWN_SIZE                                    0x1
#define _BD1OST_OWN_LENGTH                                  0x1
#define _BD1OST_OWN_MASK                                    0x80
#define _BD1OST_BSTALL_POSN                                 0x2
#define _BD1OST_BSTALL_POSITION                             0x2
#define _BD1OST_BSTALL_SIZE                                 0x1
#define _BD1OST_BSTALL_LENGTH                               0x1
#define _BD1OST_BSTALL_MASK                                 0x4
#define _BD1OST_DTS_POSN                                    0x3
#define _BD1OST_DTS_POSITION                                0x3
#define _BD1OST_DTS_SIZE                                    0x1
#define _BD1OST_DTS_LENGTH                                  0x1
#define _BD1OST_DTS_MASK                                    0x8

// Register: BD1OBC
#define BD1OBC BD1OBC
extern volatile unsigned char           BD1OBC              __at(0x1A9);
#ifndef _LIB_BUILD
asm("BD1OBC equ 01A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD1OBCbits_t;
extern volatile BD1OBCbits_t BD1OBCbits __at(0x1A9);
// bitfield macros
#define _BD1OBC_BC_POSN                                     0x0
#define _BD1OBC_BC_POSITION                                 0x0
#define _BD1OBC_BC_SIZE                                     0x4
#define _BD1OBC_BC_LENGTH                                   0x4
#define _BD1OBC_BC_MASK                                     0xF
#define _BD1OBC_BC0_POSN                                    0x0
#define _BD1OBC_BC0_POSITION                                0x0
#define _BD1OBC_BC0_SIZE                                    0x1
#define _BD1OBC_BC0_LENGTH                                  0x1
#define _BD1OBC_BC0_MASK                                    0x1
#define _BD1OBC_BC1_POSN                                    0x1
#define _BD1OBC_BC1_POSITION                                0x1
#define _BD1OBC_BC1_SIZE                                    0x1
#define _BD1OBC_BC1_LENGTH                                  0x1
#define _BD1OBC_BC1_MASK                                    0x2
#define _BD1OBC_BC2_POSN                                    0x2
#define _BD1OBC_BC2_POSITION                                0x2
#define _BD1OBC_BC2_SIZE                                    0x1
#define _BD1OBC_BC2_LENGTH                                  0x1
#define _BD1OBC_BC2_MASK                                    0x4
#define _BD1OBC_BC3_POSN                                    0x3
#define _BD1OBC_BC3_POSITION                                0x3
#define _BD1OBC_BC3_SIZE                                    0x1
#define _BD1OBC_BC3_LENGTH                                  0x1
#define _BD1OBC_BC3_MASK                                    0x8

