MikroElektronika/core_packages/PIC/XC8/def/PIC16C745/mcu.h
// Register: BD2OBC
#define BD2OBC BD2OBC
extern volatile unsigned char           BD2OBC              __at(0x1B1);
#ifndef _LIB_BUILD
asm("BD2OBC equ 01B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD2OBCbits_t;
extern volatile BD2OBCbits_t BD2OBCbits __at(0x1B1);
// bitfield macros
#define _BD2OBC_BC_POSN                                     0x0
#define _BD2OBC_BC_POSITION                                 0x0
#define _BD2OBC_BC_SIZE                                     0x4
#define _BD2OBC_BC_LENGTH                                   0x4
#define _BD2OBC_BC_MASK                                     0xF
#define _BD2OBC_BC0_POSN                                    0x0
#define _BD2OBC_BC0_POSITION                                0x0
#define _BD2OBC_BC0_SIZE                                    0x1
#define _BD2OBC_BC0_LENGTH                                  0x1
#define _BD2OBC_BC0_MASK                                    0x1
#define _BD2OBC_BC1_POSN                                    0x1
#define _BD2OBC_BC1_POSITION                                0x1
#define _BD2OBC_BC1_SIZE                                    0x1
#define _BD2OBC_BC1_LENGTH                                  0x1
#define _BD2OBC_BC1_MASK                                    0x2
#define _BD2OBC_BC2_POSN                                    0x2
#define _BD2OBC_BC2_POSITION                                0x2
#define _BD2OBC_BC2_SIZE                                    0x1
#define _BD2OBC_BC2_LENGTH                                  0x1
#define _BD2OBC_BC2_MASK                                    0x4
#define _BD2OBC_BC3_POSN                                    0x3
#define _BD2OBC_BC3_POSITION                                0x3
#define _BD2OBC_BC3_SIZE                                    0x1
#define _BD2OBC_BC3_LENGTH                                  0x1
#define _BD2OBC_BC3_MASK                                    0x8

// Register: BD2OAL
#define BD2OAL BD2OAL
extern volatile unsigned char           BD2OAL              __at(0x1B2);
#ifndef _LIB_BUILD
asm("BD2OAL equ 01B2h");
#endif

// Register: BD2IST
#define BD2IST BD2IST
extern volatile unsigned char           BD2IST              __at(0x1B4);
#ifndef _LIB_BUILD
asm("BD2IST equ 01B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD2ISTbits_t;
extern volatile BD2ISTbits_t BD2ISTbits __at(0x1B4);
// bitfield macros
#define _BD2IST_PID0_BSTALL_POSN                            0x2
#define _BD2IST_PID0_BSTALL_POSITION                        0x2
#define _BD2IST_PID0_BSTALL_SIZE                            0x1
#define _BD2IST_PID0_BSTALL_LENGTH                          0x1
#define _BD2IST_PID0_BSTALL_MASK                            0x4
#define _BD2IST_PID1_DTS_POSN                               0x3
#define _BD2IST_PID1_DTS_POSITION                           0x3
#define _BD2IST_PID1_DTS_SIZE                               0x1
#define _BD2IST_PID1_DTS_LENGTH                             0x1
#define _BD2IST_PID1_DTS_MASK                               0x8
#define _BD2IST_PID2_POSN                                   0x4
#define _BD2IST_PID2_POSITION                               0x4
#define _BD2IST_PID2_SIZE                                   0x1
#define _BD2IST_PID2_LENGTH                                 0x1
#define _BD2IST_PID2_MASK                                   0x10
#define _BD2IST_PID3_POSN                                   0x5
#define _BD2IST_PID3_POSITION                               0x5
#define _BD2IST_PID3_SIZE                                   0x1
#define _BD2IST_PID3_LENGTH                                 0x1
#define _BD2IST_PID3_MASK                                   0x20
#define _BD2IST_DATA0_1_POSN                                0x6
#define _BD2IST_DATA0_1_POSITION                            0x6
#define _BD2IST_DATA0_1_SIZE                                0x1
#define _BD2IST_DATA0_1_LENGTH                              0x1
#define _BD2IST_DATA0_1_MASK                                0x40
#define _BD2IST_UOWN_POSN                                   0x7
#define _BD2IST_UOWN_POSITION                               0x7
#define _BD2IST_UOWN_SIZE                                   0x1
#define _BD2IST_UOWN_LENGTH                                 0x1
#define _BD2IST_UOWN_MASK                                   0x80
#define _BD2IST_PID0_POSN                                   0x2
#define _BD2IST_PID0_POSITION                               0x2
#define _BD2IST_PID0_SIZE                                   0x1
#define _BD2IST_PID0_LENGTH                                 0x1
#define _BD2IST_PID0_MASK                                   0x4
#define _BD2IST_PID1_POSN                                   0x3
#define _BD2IST_PID1_POSITION                               0x3
#define _BD2IST_PID1_SIZE                                   0x1
#define _BD2IST_PID1_LENGTH                                 0x1
#define _BD2IST_PID1_MASK                                   0x8
#define _BD2IST_DATA01_POSN                                 0x6
#define _BD2IST_DATA01_POSITION                             0x6
#define _BD2IST_DATA01_SIZE                                 0x1
#define _BD2IST_DATA01_LENGTH                               0x1
#define _BD2IST_DATA01_MASK                                 0x40
#define _BD2IST_OWN_POSN                                    0x7
#define _BD2IST_OWN_POSITION                                0x7
#define _BD2IST_OWN_SIZE                                    0x1
#define _BD2IST_OWN_LENGTH                                  0x1
#define _BD2IST_OWN_MASK                                    0x80
#define _BD2IST_BSTALL_POSN                                 0x2
#define _BD2IST_BSTALL_POSITION                             0x2
#define _BD2IST_BSTALL_SIZE                                 0x1
#define _BD2IST_BSTALL_LENGTH                               0x1
#define _BD2IST_BSTALL_MASK                                 0x4
#define _BD2IST_DTS_POSN                                    0x3
#define _BD2IST_DTS_POSITION                                0x3
#define _BD2IST_DTS_SIZE                                    0x1
#define _BD2IST_DTS_LENGTH                                  0x1
#define _BD2IST_DTS_MASK                                    0x8

// Register: BD2IBC
#define BD2IBC BD2IBC
extern volatile unsigned char           BD2IBC              __at(0x1B5);
#ifndef _LIB_BUILD
asm("BD2IBC equ 01B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD2IBCbits_t;
extern volatile BD2IBCbits_t BD2IBCbits __at(0x1B5);
// bitfield macros
#define _BD2IBC_BC_POSN                                     0x0
#define _BD2IBC_BC_POSITION                                 0x0
#define _BD2IBC_BC_SIZE                                     0x4
#define _BD2IBC_BC_LENGTH                                   0x4
#define _BD2IBC_BC_MASK                                     0xF
#define _BD2IBC_BC0_POSN                                    0x0
#define _BD2IBC_BC0_POSITION                                0x0
#define _BD2IBC_BC0_SIZE                                    0x1
#define _BD2IBC_BC0_LENGTH                                  0x1
#define _BD2IBC_BC0_MASK                                    0x1
#define _BD2IBC_BC1_POSN                                    0x1
#define _BD2IBC_BC1_POSITION                                0x1
#define _BD2IBC_BC1_SIZE                                    0x1
#define _BD2IBC_BC1_LENGTH                                  0x1
#define _BD2IBC_BC1_MASK                                    0x2
#define _BD2IBC_BC2_POSN                                    0x2
#define _BD2IBC_BC2_POSITION                                0x2
#define _BD2IBC_BC2_SIZE                                    0x1
#define _BD2IBC_BC2_LENGTH                                  0x1
#define _BD2IBC_BC2_MASK                                    0x4
#define _BD2IBC_BC3_POSN                                    0x3
#define _BD2IBC_BC3_POSITION                                0x3
#define _BD2IBC_BC3_SIZE                                    0x1
#define _BD2IBC_BC3_LENGTH                                  0x1
#define _BD2IBC_BC3_MASK                                    0x8

